Revit 2027 API
BuiltInFailures.ImportFailures.ImportedModelWithDifferentLengthUnits Property
 The imported model uses different length units, Revit will default to auto-detect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ImportedModelWithDifferentLengthUnits { get; }
Public Shared ReadOnly Property ImportedModelWithDifferentLengthUnits As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ImportedModelWithDifferentLengthUnits {
	FailureDefinitionId^ get ();
}
static member ImportedModelWithDifferentLengthUnits : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace